read_verilog led_toggle.v

# Create clock with 40 ns period (25MHz frequency)
create_clock -period 40.00 -name i_clk

# Synthesize
synth_ice40 -json led_toggle.json